{
    "categories": {
        "0": "productivity",
        "1": "technical",
        "2": "media",
        "3": "small business",
        "4": "data (things)"
    },
    "demo_page": "",
    "description": "Collaborate with your team\n\nWhether your teams are co-located, distributed, or remote with Whiteboard Team you, will experience real-time teamwork on an online whiteboard.\n\nGet visual feedback\n\nIncrease productivity and efficiency by collaborating on a real-time online whiteboard. Whiteboard Team enables you to collaborate and communicate better.\n\nVisualize and explain your ideas\n\nWhiteboard Team provides an infinite zoom-able canvas with basic shapes and sticky notes to help you visually express and share your thoughts.\n",
    "image": "//s3.amazonaws.com/appforest_uf/f1647462081623x360430632859984450/logo.png",
    "license": "open_source",
    "link": "https://www.whiteboard.team/",
    "name": "Whiteboard",
    "plugin_instructions": "- - - - - SETUP & TUTORIAL - - - - -\n\nStep 1) Create an account : https://www.whiteboard.team/\n\nStep 2) Head over to the <developers> section of the Dashboard, and click create an app. You will be prompted to choose a name for your app.\n\nStep 3) Write down your Client ID & Client Secret. Do not share your these with anyone.\n\nStep 4) Enter your Client ID in the appropriate boxes under the \"plugins\" section of your bubble app.\n\nYour whiteboard is now ready for use. Simply find the whiteboard element inside the bubble editor and draw a shape. Then it give it a board code inside the appropriate field. Board codes must be at least 15 characters long and they should be unique.\n\nTutorial: https://www.youtube.com/watch?v=uGkSD0IlAcw\n\n\n- - - - - ROLES - - - - -\n\n\nIf you would like to restrict access to whiteboard functionality for groups of users, you must define roles. There are three roles: viewer, editor and facilitator.\n\nViewer: May only view a board\n\nEditor: Can view and edit a board\n\nFacilitator: Can view, edit and clear a board\n\nBy default, a person visiting your page (logged-in or not) will be assigned as an editor. However, if you would like for a certain group of users to only be able to view a board, you must provide a list of their emails in the \"viewers\" field of the element.\n\nFor example, \"Viewers\" : \"Do a Search For Users: each item's emails\"\n\nAssigning roles are optional. But be careful, once a role has been defined (for either viewer, editor or facilitator) then the default role now becomes viewer. \n\nIn other words, if you define a role for facilitator you must make sure that you also define viewers and editors. In the case where there are roles assigned, and the current user's role is not defined, then the role will default to viewer.\n\nAn important thing to take note is that if a user is given more than one role, then the role with the most privileges will take priority.\n\nFor example, if user1 is given roles viewer and editor, then the user1 will be an editor. Also, if user2 is given roles editor and facilitator, then user2 is a facilitator.\n\n\n- - - - - SUPPORT - - - - -\n\nFor more questions feel free to leave a comment here: \n\nhttps://www.youtube.com/watch?v=uGkSD0IlAcw\n\nOr visit the GitHub repository and figure it out yourself:\n\nhttps://github.com/deleseleuc-jonah/Bubble-Plugin-Whiteboard\n\n\n- - - - - READ THE TERMS AND CONDITIONS - - - - -\n\nhttps://www.whiteboard.team/info/developer-terms\n"
}